package ru.mail.telo



//✅ Задача 1: Расчёт скидки в магазине
//
//Условие:
//
//Покупатель вводит сумму покупки. Если сумма:
//
//меньше 1000 — скидки нет
//от 1000 до 5000 — 5%
//от 5000 до 10000 — 10%
//больше 10000 — 15%
//Твоя задача:
//
//Написать функцию calculateDiscountedPrice(amount: Double): Double, которая возвращает сумму с учётом скидки
//В main запросить сумму, вызвать функцию и вывести результат
//🧩 Что ты тренируешь:
//
//if/else или when — выбор варианта скидки
//Double + вычисления
//Функции и параметры
